nc: 2  # Number of classes (PET, HDPE)

scale:  # Adjust model scaling for better accuracy
  x: [1.00, 1.25, 512]  # 'x' (extra-large) for best accuracy

backbone:
  # Feature extraction layers
  - [-1, 1, Conv, [32, 3, 1]]  # 0-P1/2 | Reduced filters and stride
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [64, True]]   # Reduced filters in C2f
  - [-1, 1, Conv, [128, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [128, True]]   # Reduced filters in C2f
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [256, True]]   # Reduced filters in C2f
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [512, True]]   # Reduced filters in C2f
  - [-1, 1, SPPF, [512, 5]]  # 9 | Reduced filters in SPPF

head:
  # Detection layers
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # concat backbone P4
  - [-1, 3, C2f, [256]]  # Reduced filters

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # concat backbone P3
  - [-1, 3, C2f, [128]]  # Reduced filters

  - [-1, 1, Conv, [128, 3, 2]]  # Reduced filters
  - [[-1, 12], 1, Concat, [1]]  # concat head P4
  - [-1, 3, C2f, [256]]  # Reduced filters

  - [-1, 1, Conv, [256, 3, 2]]  # Reduced filters
  - [[-1, 9], 1, Concat, [1]]  # concat head P5
  - [-1, 3, C2f, [512]]  # Reduced filters

  - [[15, 18, 21], 1, Detect, [nc]]  # Detection at P3, P4, P5